src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <attributes>
    <name>РозничнаяЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупочнаяЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ТиповыеРассчеты/Module.bsl
&НаКлиенте
Процедура РассчетСуммы(Элемент,Объект) Экспорт
	Строка = Объект.Товары.ТекущиеДанные;
	Строка.Сумма = Строка.Количество*Строка.ЦенаЕденицы;	
КонецПроцедуры

&НаСервере 
Процедура УзнатьЦенуТовара(Номенклатура,Цена,ТребуемоеЗначение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.РозничнаяЦена КАК Цена,
	|	Номенклатура.ЗакупочнаяЦена КАК ЗакупочнаяЦена
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Строка(Номенклатура));
	
	Результат = Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() цикл
	//	
	//КонецЦикла;
	Пока Результат.Следующий() Цикл
		Если ТребуемоеЗначение = "Закупочная" тогда
		Цена = Результат.ЗакупочнаяЦена;
		Прервать;
	КонецЕсли;
	
		Если ТребуемоеЗначение = "Розничная"  тогда
			Цена = Результат.Цена;
		КонецЕсли;
				Сообщить(Строка(Результат.Цена));
	КонецЦикла;
КонецПроцедуры
